<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN"
"http://www.w3.org/TR/html4/strict.dtd">
<html>
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
      <title>4tas. Jornadas de Ciencias de la Computaci&oacute;n</title>
      <link rel="stylesheet" href="programa.css" type="text/css">
   </head>
   <body>
        <div id="title">
            <h1>4tas. Jornadas de Ciencias de la Computación</h1>
            <h1>26 y 27 de octubre de 2006</h1>
            <h2>Facultad de Ciencias Exactas Ingeniería y Agrimensura</h2>
            <h2>Universidad Nacional de Rosario</h2>
        </div>
        <p>Lugar: Facultad de Ciencias Exactas, Ingeniería y Agrimensura. Av. Pellegrini 250, Rosario.</p>
        <p>Organiza: <a href="http://www.fceia.unr.edu.ar/lcc/">Departamento de Ciencias de la Computación</a></p>
        <p>Las Jornadas de Ciencias de la Computación (JCC) se presentan como una iniciativa del Departamento de Ciencias de la Computación de la Facultad de Ciencias Exactas, Ingeniería y Agrimensura de la Universidad Nacional de Rosario, de carácter abierto y gratuito con el objetivo de promover el contacto de los alumnos de la Facultad con investigadores y profesionales en temas relacionados con el ámbito de las ciencias de la computación.</p>

Cronograma de actividades:<br><br>

        <table class="cronograma">
            <tr>
              <th colspan="2">Jueves 26</th>
            </tr>
            <tr class="charlaInvitado">
              <td class="horario">10h00</td>
                <td><div class="titulo">Proyecto C.I.D.R.A.</div>
                    <div class="disertante">Miembros del grupo: Adrián Biga, Sergio Grimi, Walter Lozano, Gonzalo
Sambucaro, Sebastián Nachez </div>
                    <div class="resumen">Experiencia de estudiantes y egresados de
LCC que actualmente firmaron un acuerdo con el "Vivero de empresas de
Base Tecnológica" para incubar su empresa.</div></td></tr>
            <tr class="charlaAlumno">
              <td class="horario">11h00</td>
                <td>
					<div class="tipocharla">Presentación de trabajos de estudiantes:</div>
                    <div class="titulo">Un sistema de b&uacute;squeda asistida de informaci&oacute;n m&eacute;dica en la web</div>
                    <div class="disertante">Anabella Dallosta</div>
                    <div class="resumen"> En este trabajo se presenta un sistema de b&uacute;squeda de informaci&oacute;n en repositorios de literatura
m&eacute;dica. Adem&aacute;s de su simplicidad y bajo costo de implementaci&oacute;n, otra ventaja de esta
arquitectura es que la interacci&oacute;n con el usuario permite aumentar la precisi&oacute;n de los
resultados. Esto es &uacute;til para usuarios inexpertos en la b&uacute;squeda de informaci&oacute;n. Se realiz&oacute; una
experimentaci&oacute;n con m&eacute;dicos de distintas especialidades, con y sin conocimientos en
b&uacute;squedas en la Web. Las b&uacute;squedas se realizaron sin expansi&oacute;n y con expansi&oacute;n de
conceptos, utilizando MeSH como recurso ling&uuml;&iacute;stico y Yahoo! como buscador. Los
resultados de la experimentaci&oacute;n muestran una mejora en la precisi&oacute;n de la b&uacute;squeda.<br >
<a href="slides/2006-dallosta.pdf">Presentación</a>
</div></td></tr>
            <tr><td colspan="2" class="receso">Receso</td></tr>
                                <tr class="charlaInvitado">
                                  <td class="horario">15h00</td>
                <td>
<div class="titulo">Actividades y Proyectos en M&eacute;todos Formales, en Uruguay</div>
                    <div class="disertante"><a href="http://www.fing.edu.uy/~cluna/">Carlos Luna</a></div>
                    <div class="resumen">En esta charla presentaremos al grupo de M&eacute;todos Formales del Instituto  de Computaci&oacute;n de la Facultad de Ingener&iacute;a de la Universidad de la  Rep&uacute;blica, Uruguay. En especial haremos &eacute;nfasis en las actividades y  proyectos en curso, en los cursos de grado y postgrado que venimos  desarrollando y, en algunas l&iacute;neas de investigaci&oacute;n en las cuales  estamos interesados en trabajar en los pr&oacute;ximos a&ntilde;os.<br>
<a href="slides/2006-luna.ppt">Presentación</a>
</div></td></tr>
            <tr class="charlaInvitado">
              <td class="horario">16h00</td>
                <td>
                    <div class="titulo">Estudio e implementaci&oacute;n del algoritmo ADIOS</div>
                    <div class="disertante"><a href="http://www.fceia.unr.edu.ar/~eruiz0/CV.htm">Esteban Ruiz</a></div>
                    <div class="resumen">Comentaré la idea general del algoritmo, algunos detalles interesantes y los problemas con los que me encontré durante el estudio y la implementación del algoritmo.
El algoritmo <a href="http://adios.tau.ac.il/">ADIOS</a> (Automatic Distillation of Structure), desarrollado por Z. Solan et al., utiliza conceptos de grafos y estadística para detectar patrones en información no estructurada, permitiendo detectar parte de la gramática subyacente y se puede aplicar tanto para lenguajes naturales como para secuencias de ADN.
<br>
<a href="slides/2006-eruiz.pdf">Presentación)</a> 
</div></td></tr>
            <tr class="charlaInvitado">
              <td class="horario">17h00</td>
                <td><div class="tipocharla">Charlas de empresas invitadas:</div>
                    <div class="titulo">CMMI y Calidad de Software</div>
                    <div class="disertante">Diego Tartarelli</div>
                    <div class="resumen">Se realizará una introducción al Modelo de Madurez de Capacidades
Integrado (Capability Maturity Model Integration - CMMI) que es
reconocido y adoptado mundialmente en la industria del software como
guía para incrementar la productividad y la calidad. El modelo está
estructurado en niveles de madurez creciente que contienen áreas de
procesos con objetivos y prácticas específicas que la organización
debe realizar para producir software bajo cierto nivel de madurez.
Dentro de América Latina, nuestro país ha sido el que mayor
crecimiento presenta en este campo, superando incluso a algunos países
de la Comunidad Europea.<br />
<a href="slides/2006-tartarelli.pdf">Presentación</a></div>
                    </td></tr>
            <tr class="charlaInvitado">
              <td class="horario">18h00</td>
                <td><div class="titulo">Digital Restrictions Management: Entretenidos y controlados</div>
                    <div class="disertante">Sebastián Criado (LUGRO)</div>
                    <div class="resumen">Los mecanismos técnicos de restricción al acceso y copia de obras publicadas 
en formatos digitales nos llevarán a un mundo donde solo tendrán acceso a la 
información quienes puedan pagarla.<br />
<a href="slides/2006-criado.swf">Presentación</a>
</div>
                    </td></tr>
        </table>
        <table class="cronograma">
            <tr>
              <th colspan="2">Viernes 27</th>
            </tr>
            <tr class="charlaInvitado"><td class="horario">10h00</td>
                <td><div class="titulo">Brev&iacute;sima Introducción a la Computaci&oacute;n Cu&aacute;ntica</div>
                    <div class="disertante"><a href="http://www.fceia.unr.edu.ar/~diazcaro">Alejandro D&iacute;az Caro</a>, Juli&aacute;n Samborski Forlese</div>
                    <div class="resumen">La progresiva miniaturización de los chips de computadoras se está
acercado al limite de las leyes físicas clásicas. La computación
actual busca nuevos caminos y la computación cuántica se presenta como
una alternativa diferente y revolucionaria. En esta charla se hará una
breve introducción al tema, explicando algunos conceptos básicos, como
la noción de qubit, enredo cuántico y paralelismo. Como agregado, se
presentará un protocolo inviolable para la transmision de claves a
través de canales inseguros.<br>
<a href="slides/2006-diazcaro-samborskiforlese.pdf">Presentación</a>
</div></td></tr>
            <tr class="charlaAlumno">
              <td class="horario">11h00</td>
                <td>
					<div class="tipocharla">Presentación de trabajos de estudiantes:</div>
                    <div class="titulo">Dise&ntilde;o, Implementaci&oacute;n y Evaluaci&oacute;n de un Modelo de Optimizaci&oacute;n de
Costos en Comunicaciones Telef&oacute;nicas</div>
                    <div class="disertante">Pablo Pilotti, Mauricio Notti y Pablo Speciale</div>
                    <div class="resumen">En este trabajo se considera la resoluci&oacute;n de un problema real
relativo al tr&aacute;&#64257;co de llamadas telef&oacute;nicas de una central. Una empresa
cuenta con una central telef&oacute;nica por la cual se derivan llamadas.
Dicha empresa puede contratar para la realizaci&oacute;n de &eacute;stas a distintas
compa&ntilde;&iacute;as telef&oacute;nicas, las cuales ofrecen diferentes tarifas de
acuerdo a las caracter&iacute;sticas de cada llamada. Se desea disminuir el
costo de facturaci&oacute;n mensual de la empresa interesada. Se presenta un
modelo matem&aacute;tico de programaci&oacute;n lineal entera que brinde una
soluci&oacute;n aproximada al problema planteado, y se analiza la correcci&oacute;n
y e&#64257;ciencia del mismo.<br>
<a href="slides/2006-notti-pilotti-speciale.pdf">Presentación</a> </div></td></tr>                    
            <tr class="charlaInvitado"><td class="horario">11h30</td>
                <td><div class="titulo">Generación automática de invariantes para implementar eficientemente Regiones Críticas Condicionales</div>
                    <div class="disertante"><a href="http://www.cs.famaf.unc.edu.ar/~damian/">Damián Barsotti</a> (UNC)</div>
                    <div class="resumen">La técnica de semáforos binarios divididos (SBS) brinda tanto los
programas que implementan secciones críticas condicionales como los
invariantes iniciales que aseguran su corrección.
Aplicando la técnica a casos particulares se encuentran programas que
admiten simplificaciones.<br>
<br>
Este trabajo se concentra en el desarrollo de un procedimiento para
verificar la corrección de estas simplificaciones de forma
automática. Nos enfocamos particularmente en la eliminación de guardas en
las sentencias condicionales finales de los programas, pero el
procedimiento encontrado permite su generalización a otros tipos de
simplificaciones.
<br>
<br>
El procedimiento consiste en hacer una búsqueda de nuevos invariantes que
avalen la corrección de las simplificaciones. Su implementación fue
realizada en ML usando los demostradores Isabelle/HOL y CVC~Lite para
demostrar las implicaciones y simplificar fórmulas lógicas.
<br>
<a href="slides/2006-barsotti.pdf">Presentación</a>
</div></td></tr>
            <tr><td colspan="2" class="receso">Receso</td></tr>
            <tr class="charlaInvitado">
              <td class="horario">15h00</td>
                <td>
                    <div class="titulo">Una introducción básica a sistemas de tipos estáticos</div>
                    <div class="disertante">Pablo E. Martínez López</div>
                    <div class="resumen">En esta charla daré un breve pantallazo de las principales
características de los sistemas de tipos estáticos, sus formas de
presentación y el impacto de estas técnicas en desarrollos modernos.
Ejemplificaré algunas de las nociones con un lenguaje muy sencillo,
intentando mantener el nivel técnico de la charla en un nivel
razonable para el público general.<br >
<a href="slides/2006-fidel.ppt">Presentación</a></div></td></tr>
            <tr class="charlaInvitado">
              <td class="horario">16h00</td>
                <td>
                    <div class="titulo">Verificaci&oacute;n de modelos</div>
                    <div class="disertante"><a href="http://www.fing.edu.uy/~sierra/">Luis Sierra</a></div>
                    <div class="resumen">En esta charla presentamos el problema de la verificación de modelos
aplicada a la verificación de sistemas informáticos. El planteo
general del problema es el siguiente:<br>
- dado un sistema S y una propiedad p, averiguar si S satisface p.<br>
La presentación matemática del problema plantea que el sistema informático
es una estructura, y la propiedad una fórmula. Por lo tanto, el problema
se reduce al de averiguar si p vale en S.
Este enfoque proporciona una gran cantidad de variantes, centradas en
las siguientes preguntas:<br>
- ¿cómo especificar el sistema?<br>
- ¿cómo especificar sus propiedades?<br>
En esta charla mostraremos algunas de estas variantes que han sido exploradas
en el curso de Verificación y Lógica. El curso Modelos y verificación de
sistemas de tiempo real realiza una presentación de estas estrategias
para el caso específico en que el tiempo se convierte en un actor
principal de los sistemas.</div></td></tr>
            <tr class="otra"><td class="horario">17h00</td>
                <td>
                    <div class="titulo">Panel sobre planes de estudios</div>
                    <div class="disertante"></div>
              </td></tr>
            <tr class="otra">
              <td class="horario">19h00</td>
                <td>
                    <div class="titulo">Acto de clausura y entrega de diplomas de fin de cursado</div>
                    <div class="disertante"></div>
              </td></tr>
            <tr class="otra">
              <td class="horario">20h30</td>
                <td>
                    <div class="titulo">Cena de camarader&iacute;a</div>
                    <div class="disertante"></div>
              </td></tr>
   </table>


	<p>Jornadas anteriores: <a href="../2005/">2005</a></p>

</body>
</html>
