<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html><head>
	
	<title>V Jornadas de Ciencias de la Computaci&oacute;n</title>
    <link rel="stylesheet" type="text/css" href="style.css">
    <script type="text/javascript" src="jcc.js"></script>
</head>


<body bottommargin="0" leftmargin="0" rightmargin="0" topmargin="0" background="img/background.jpg" marginheight="0" marginwidth="0">

<center><table background="img/mainbackground.jpg" border="0" cellpadding="0" cellspacing="0" height="100%" width="765"><tbody><tr valign="top"><td>

<table style="width: 764px; height: 89px;" border="0" cellpadding="0" cellspacing="0">
	<tbody><tr valign="top">
<td width="319"><!-- logo image --><!-- end logo image --></td>
<td width="114" background="img/toplogobg.jpg" style="width: 100%; vertical-align: top; color: white; background-color: rgb(6, 6, 6);"><a href="index.html"><img src="img/logo.png" width="533" height="97" border="0" longdesc="http://www.fceia.unr.edu.ar/lcc/jcc"></a></td>
<td width="331" background="img/toplogobg.jpg" style="width: 100%; vertical-align: top; color: white; background-color: rgb(6, 6, 6);"><img style="border: 0px solid ; width: 22px; height: 97px;" src="img/toplogobg.jpg" alt="" align="middle"></td>
	</tr>
</tbody></table>
<table border="0" cellpadding="0" cellspacing="0" height="42" width="764">
	<tbody><tr valign="top">
<td width="169"><img src="img/left1.jpg" alt="" border="0" height="42" width="169"></td>
<td background="img/left1bg.jpg" width="100%"><img src="img/left1bg.jpg" alt="" border="0" height="42" width="20"></td>
	</tr>
</tbody></table>

<table border="0" cellpadding="0" cellspacing="0" width="764">
	<tbody><tr valign="top">

<td width="150" rowspan="2">
<p>
  <!-- menu below, copy and paste the menudivider.jpg code as necessary -->
  <!-- the &nbsp; is code for a one letter space -->
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
  &nbsp; <a href="index.html">Principal</a><br>
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
  &nbsp; <a href="cronograma.html">Cronograma</a><br>
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
  &nbsp; <a href="comollegar.html">C&oacute;mo llegar</a><br>
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
  &nbsp; <a href="hospedaje.html">D&oacute;nde hospedarse</a><br>
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
  &nbsp; <a href="contacto.html">Contacto</a><br>
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
  &nbsp; <a href="diplomas.html">Entrega de Diplomas</a><br>
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
  &nbsp; <a href="anteriores.html">Jornadas anteriores</a><br>
  <img src="img/menudivider.jpg" alt="" border="0" height="6" width="150"><br>
</p>
<p align="center">&nbsp;</p>
<p align="center">&nbsp;</p>
<p align="center">&nbsp;</p>
<p align="center">&nbsp;</p>
<!-- end menu --></td>
<td width="10" rowspan="2">&nbsp;</td>
<td width="744" height="608">

<p align="center">
  <!-- add your content below --><img src="img/unr-frente.jpg" width="603" height="151"></p>
<p><img src="img/cronograma.png" alt="" border="0" height="28" width="107"></p>
<table width="500" border="0" align="center" cellpadding="0" cellspacing="0" class="cronograma">
  <tr>
    <th colspan="2" scope="col">Jueves 11</th>
    </tr>
  <tr>
    <td width="83" class="horario" scope="col">8:45 <span class="emph-red"><br>
      Aula 14</span></td>
    <td width="401" scope="col"><p class="charlaInvitado">Apertura de las Jornadas</p>      </td>
    </tr>
  <tr>
    <td class="horario">9:00 <br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Agentes Intencionales para actuar bajo Incertidumbre</span><br>
        <span class="disertante">Ana Casali </span> <a href="slides/2007-casali.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <div id="casaliChico" style="display:inline;"> 
          <p class="resumen">En los &uacute;ltimos a&ntilde;os se ha incrementado el dise&ntilde;o e implementaci&oacute;n de sistemas multiagentes (MAS), para abordar el desarrollo de sistemas distribuidos complejos.  Para dar un sustento formal a estos sistemas, se han propuesto distintas teor&iacute;as y arquitecturas, entre ellas se ha destacado el modelo BDI  (Belief, Desire, Intention).</p>
          <p class="resumen">Para que la aplicaci&oacute;n de los agentes en dominios reales se acreciente, es importante que los modelos formales incorporen el tratamiento de la incertidumbre. <span class="leer-mas" onClick="javascript:showAbstract('casali');">[Leer m&aacute;s]</span></p>
          </div>
      <div id="casaliCompleto" style="display:none"> 
      	  <p class="resumen">En los &uacute;ltimos a&ntilde;os se ha incrementado el dise&ntilde;o e implementaci&oacute;n de sistemas multiagentes (MAS), para abordar el desarrollo de sistemas distribuidos complejos.  Para dar un sustento formal a estos sistemas, se han propuesto distintas teor&iacute;as y arquitecturas, entre ellas se ha destacado el modelo BDI  (Belief, Desire, Intention).</p>
          <p class="resumen">Para que la aplicaci&oacute;n de los agentes en dominios reales se acreciente, es importante que los modelos formales incorporen el tratamiento de la incertidumbre.</p>
          <p class="resumen">En esta charla se  presentar&aacute;  un modelo general para especificar agentes  BDI graduados (g-BDI agents) con  una arquitectura basada en los sistemas multicontextos (MCS) Este modelo permite razonar bajo la incertidumbre del entorno y actitudes mentales graduadas.</p>
          <p class="resumen">La  sem&aacute;ntica operacional de este modelo de agente se ha formalizado utilizado process calculus. Tambi&eacute;n se ha trabajado en  un marco metodol&oacute;gico para desarrollar sistemas basados en g-BDI agents.  Utilizando la metodolog&iacute;a propuesta se ha dise&ntilde;ado un caso de estudio  en el dominio del turismo argentino, el cu&aacute;l se encuentra en experimentaci&oacute;n. <span class="leer-mas" onClick="javascript:hideAbstract('casali');">[Ocultar]</span></p>
      </div>     </td>
    </tr>
  <tr>
    <td class="horario">10:00<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Aspectos Inform&aacute;ticos de un Dispositivo Hipermedial context-aware Din&aacute;mico para educaci&oacute;n e investigaci&oacute;n</span><br>
        <span class="disertante">Alejandro Sartorio - Patricia San Martin </span><a href="slides/2007-sartorio-sanmartin.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      
      <div id="sartorioChico" style="display:inline;"> 
      <p class="resumen">Objetivos:</p>
        <ul>
          <li class="resumen">Presentar el concepto de Dispositivo Hipermedial context-aware Din&aacute;mico <span style="white-space:nowrap;">(DHc-aD)</span>.</li>
          <li class="resumen">Comunicar los aportes inform&aacute;ticos propuestos en el Proyecto de I&amp;D &quot;Obra Abierta&quot; (CONICET - UNR - IMAGE CAMPUS S.A.). <span class="leer-mas" onClick="javascript:showAbstract('sartorio');">[Leer m&aacute;s]</span></li>
        </ul>
      </div>
      
      <div id="sartorioCompleto" style="display:none"> 
        <p class="resumen">Objetivos:</p>
        <ul>
          <li class="resumen">Presentar el concepto de Dispositivo Hipermedial context-aware Din&aacute;mico <span style="white-space:nowrap;">(DHc-aD)</span>.</li>
          <li class="resumen">Comunicar los aportes inform&aacute;ticos propuestos en el Proyecto de I&amp;D &quot;Obra Abierta&quot; (CONICET - UNR - IMAGE CAMPUS S.A.)</li>
        </ul>
        <p>Contenidos tem&aacute;ticos:</p>
        <ul>
          <li class="resumen">Una propuesta de evoluci&oacute;n desde una Aplicaci&oacute;n e-learning a un Dispositivo Hipermedial context-aware Din&aacute;mico.</li>
          <li class="resumen">Componentes y conceptos de una Plataforma e-learning.</li>
          <li class="resumen">Componentes y conceptos de un framework context-aware</li>
          <li class="resumen">La teor&iacute;a de coordinaci&oacute;n de contratos como abstracci&oacute;n de las relaciones (alumno-herramienta) con aspectos context-awareness.</li>
          <li class="resumen">Modelos de procesos e-learning de un DHc-aD.</li>
          <li class="resumen">El contrato como conector entre un modelo externo de M&eacute;trica para la medici&oacute;n de interactividad de los alumnos y de Data Mining para la clasificaci&oacute;n de las intervenciones de los alumnos en los foros. <span class="leer-mas" onClick="javascript:hideAbstract('sartorio');">[Ocultar]</span></li>
        </ul>
      </div>    </td>
  </tr>
  <tr>
    <td class="horario">10:50<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Introduction to Virtualization Technology (Aula 14)</span><br>
        <span class="disertante">Gisela Giusti (Intel)      </span> <a href="slides/2007-giusti.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
        
        
      <div id="giustiChico" style="display:inline;"> 
      <p class="resumen">En la actualidad se escucha recurrentemente el t&eacute;rmino Virtualizaci&oacute;n en distintos &aacute;mbitos de la inform&aacute;tica. En esta presentaci&oacute;n se har&aacute; una introducci&oacute;n al tema de &quot;Hardware Enabled Virtualization&quot;, que consiste en el soporte en hardware para asistir a la ejecuci&oacute;n de varios Sistemas Operativos en un mismo sistema, sin requerir modificarlos y con m&iacute;nima penalizaci&oacute;n en performance.
		<span class="leer-mas" onClick="javascript:showAbstract('giusti');">[Leer m&aacute;s]</span><br></p>
		</div>

	<div id="giustiCompleto" style="display:none"> 
	<p class="resumen">En la actualidad se escucha recurrentemente el t&eacute;rmino Virtualizaci&oacute;n en distintos &aacute;mbitos de la inform&aacute;tica. En esta presentaci&oacute;n se har&aacute; una introducci&oacute;n al tema de &quot;Hardware Enabled Virtualization&quot;, que consiste en el soporte en hardware para asistir a la ejecuci&oacute;n de varios Sistemas Operativos en un mismo sistema, sin requerir modificarlos y con m&iacute;nima penalizaci&oacute;n en performance.</p>
      <p class="resumen">Se har&aacute; un repaso sobre los usos que dieron origen a la necesidad de la virtualizaci&oacute;n, se analizar&aacute;n las primeras soluciones de virtualizaci&oacute;n que no contaban con soporte de hardware, los desaf&iacute;os que dichas implementaciones plantearon, y se finalizar&aacute; analizando c&oacute;mo se atacaron dichos desaf&iacute;os mediante la ayuda de instrucciones especializadas en hardware. Es importante aclarar que la presentaci&oacute;n NO se centrar&aacute; en las soluciones particulares de la plataforma Intel.</p>
      <p class="resumen">Tambi&eacute;n se ocupar&aacute;n unos pocos minutos para presentar el centro de desarrollo de software de Intel en Argentina, las divisiones que trabajan all&iacute; y los proyectos que se llevan adelante.
		<span class="leer-mas" onClick="javascript:hideAbstract('giusti');">[Ocultar]</span></p>
		</div>
		</td>
  </tr>
  <tr>
    <td class="horario">11:30</td>
    <td><p class="charlaInvitado">Homenaje a Peter Lewis <span class="emph-red">*</span></p>      </td>
  </tr>
  <tr>
    <td colspan="2" class="receso">Receso</td>
    </tr>
  <tr>
    <td class="horario">14:30<br>      <span class="emph-red">Sal&oacute;n de Actos</span></td>
    <td><p><span class="charlaInvitado">Protecci&oacute;n de Aplicaciones Web Usando &laquo;Taint Analysis&raquo; Din&aacute;mico</span><br>
        <span class="disertante">Ariel Waissbein - Ariel Futoransky - Iv&aacute;n Arce (CoreLabs)</span><a href="slides/2007-waissbein-futoransky-arce.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <p align="justify" class="resumen">Las aplicaciones web son propensas a incluir vulnerabilidades de inyecci&oacute;n de c&oacute;digo (e.g., SQL, javascript, et cetera), cuya explotaci&oacute;n puede redundar en grandes da&ntilde;os para los due&ntilde;os y usuarios de &eacute;stas aplicaciones. En esta charla introduciremos la problem&aacute;tica de seguridad para aplicaciones web, presentaremos una t&eacute;cnica que resuelve este problema mediante la detecci&oacute;n &quot;en l&iacute;nea&quot; de ataques y su bloqueo, y describiremos a *CORE GRASP for PHP*, una implementaci&oacute;n open source que protege aplicaciones PHP.</p></td>
  </tr>
  <tr>
    <td class="horario">15:30<br>
      <span class="emph-red">Sal&oacute;n de Actos</span></td>
    <td><p><span class="charlaInvitado">Refexiones Sobre Nuestra Historia de la Computaci&oacute;n y su Preservaci&oacute;n</span><br>  
          <span class="disertante">Jorge Aguirre</span> <a href="slides/2007-jorge-aguirre.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <p align="justify" class="resumen">Se ubicar&aacute; al inicio de la Computaci&oacute;n en las universidades argentinas dentro del proceso de nacimiento y desarrollo global de la Computaci&oacute;n y dentro de la  historia de nuestro sistema universitario. Se presentaran sus hitos m&aacute;s significativos como la inserci&oacute;n de la primera computadora y la primera carrera, las EBAI, la generalizaci&oacute;n de las carreras de grado, la ESLAI, el proyecto FOMEC y el nacimiento del posgrado y la investigaci&oacute;n. Tambi&eacute;n se ver&aacute;n los retrocesos  sufridos y sus causas y consecuencias. Finalmente, se hablar&aacute; de la importancia de preservar el conocimiento hist&oacute;rico de estos procesos, del peligro actual de perder irreversiblemente alguno de sus aspectos y de los actuales esfuerzos por preservarlos como el proyecto SaMCA de la UNRC y el proyecto AHDTI  de la UTN regional Santa Fe.</p></td>
  </tr>
  <tr>
    <td class="horario">16:30<br>
      <span class="emph-red">Sal&oacute;n de Actos</span></td>
    <td><p><span class="charlaInvitado">&iquest;De qu&eacute; habla la Inform&aacute;tica?</span><br>
        <span class="disertante">Javier Blanco</span></p>
      <p class="resumen">Existen diversas maneras de concebir a la informatica y algunas de dichas concepciones son incompatibles entre si. Las discrepancias se presentan tanto expl&iacute;cita como impl&iacute;citamente y abarcan cuestiones ontol&oacute;gicas, epistemol&oacute;gicas y metodolo&oacute;gicas. Comprender bien estas disputas filos&oacute;ficas puede tener consecuencias dr&aacute;sticas en los diferentes &aacute;mbitos de desarrollo de esta disciplina. En la charla se expondr&aacute;n las caracter&iacute;sticas principales de las diferentes concepciones y se propodr&aacute; la apertura de un necesario y postergado di&aacute;logo.</p></td>
  </tr>
  <tr>
    <td class="horario">17:30<br>
      <span class="emph-red">Sal&oacute;n de Actos</span></td>
    <td><p><span class="charlaInvitado">DynAlloy: Upgrading Alloy with Actions</span><br>
        <span class="disertante">Nazareno Aguirre</span> <a href="slides/2007-nazareno-aguirre.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <p class="resumen">En esta charla, presentar&eacute; una extensi&oacute;n al lenguaje de especificaciones formales Alloy, llamada DynAlloy. Esta extensi&oacute;n permite la definici&oacute;n de acciones, y la especificaci&oacute;n de aserciones sobre trazas de ejecuci&oacute;n de sistemas, siguiendo un estilo similar al de la l&oacute;gica din&aacute;mica. A lo largo de la charla, discutir&eacute; sobre los beneficios de adoptar esta versi&oacute;n extendida de Alloy para validar propiedades de sistemas, y mostrar&eacute; que las especificaciones en DynAlloy pueden, al igual que las especificaciones en Alloy standard, validarse automaticamente. Concluir&eacute; con una comparaci&oacute;n entre el an&aacute;lisis de especificaciones de ejecuciones en Alloy (mediante una codificaci&oacute;n de trazas) y el an&aacute;lisis de especificaciones DynAlloy, para un par de casos de estudio.</p></td>
  </tr>
  <tr>
    <td class="horario">18:30<br>
      <span class="emph-red">Sal&oacute;n de Actos</span></td>
    <td><p><span class="charlaInvitado">An&aacute;lisis est&aacute;tico para seguridad en MIDP</span><br>
        <span class="disertante">Luis Sierra (Universidad de la Rep&uacute;blica, Uruguay)</span> <a href="slides/2007-sierra.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <p class="resumen">Desde el Grupo de M&eacute;todos Formales del InCo, Montevideo, estamos estudiando con algunos compa&ntilde;eros de la Facultad de Ciencias Exactas un perfil de Java ME,  el Mobile Information Device Profile.</p>
      <p class="resumen">En esta charla daremos un muy breve panorama de este producto, e iremos viendo una propuesta de an&aacute;lisis est&aacute;tico para realizar pruebas sobre su seguridad. </p>
      <p class="resumen">Adicionalmente, mostraremos algunos elementos de la programaci&oacute;n del analizador est&aacute;tico desarrollado en Python.</p></td>
  </tr>
  <tr>
    <td class="horario">19:30<br>
      <span class="emph-red">Sal&oacute;n de Actos</span></td>
    <td><p><span class="charlaInvitado">La inform&aacute;tica en la UNQ</span><br>
        <span class="disertante">Pablo E. &quot;Fidel&quot; Mart&iacute;nez L&oacute;pez</span> <a href="slides/2007-fidel.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <div id="fidelChico" style="display:inline;"> 
      	<p class="resumen">Hasta mediados de este a&ntilde;o, la inform&aacute;tica estuvo presente en la UNQ s&oacute;lo en materias individuales de diversas carreras (como automatizaci&oacute;n, biotecnolog&iacute;a o composici&oacute;n con medios electroac&uacute;sticos) y en el soporte t&eacute;cnico brindado para la operatoria normal de las oficinas.<br>
  En agosto de 2007 comienza a funcionar la Tecnicatura en Programaci&oacute;n, una carrera de pregrado orientada a la formaci&oacute;n de profesionales aptos para satisfacer la alta demanda laboral actual en el &aacute;rea. <span class="leer-mas" onClick="javascript:showAbstract('fidel');">[Leer m&aacute;s]</span></p></div>
      <div id="fidelCompleto" style="display:none"> 
      	<p class="resumen">Hasta mediados de este a&ntilde;o, la inform&aacute;tica estuvo presente en la UNQ s&oacute;lo en materias individuales de diversas carreras (como automatizaci&oacute;n, biotecnolog&iacute;a o composici&oacute;n con medios electroac&uacute;sticos) y en el soporte t&eacute;cnico brindado para la operatoria normal de las oficinas.<br>
  En agosto de 2007 comienza a funcionar la Tecnicatura en Programaci&oacute;n, una carrera de pregrado orientada a la formaci&oacute;n de profesionales aptos para satisfacer la alta demanda laboral actual en el &aacute;rea.<br>
  A partir de ello, la Universidad se propone desarrollar la inform&aacute;tica para contemplar otros aspectos escenciales, como la conformaci&oacute;n de grupos de investigaci&oacute;n, la realizacion de tareas de extensi&oacute;n y la compleci&oacute;n de la formaci&oacute;n a trav&eacute;s de la creaci&oacute;n de carreras de grado y posgrado.<br>
  En esta charla se describir&aacute; el marco institucional provisto por la UNQ y el proyecto de la misma para el desarrollo de la inform&aacute;tica. <span class="leer-mas" onClick="javascript:hideAbstract('fidel');">[Ocultar]</span></p>
      </div>      </td>
  </tr>
</table>
<br>
<table width="500" border="0" align="center" cellpadding="0" cellspacing="0" class="cronograma">
  <tr>
    <th colspan="2" scope="col">Viernes 12</th>
  </tr>
  <tr>
    <td width="83" class="horario">9:30 <span class="emph-red"><br>
      Aula 23</span></td>
    <td width="401"><p><span class="charlaInvitado">Tendencias actuales de Investigaci&oacute;n en Bases de Datos</span><br>
        <span class="disertante">Claudia Deco - Cristina Bender</span> <a href="slides/2007-deco-bender.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      
      <div id="decoChico" style="display:inline;"> 
        <p class="resumen">El objetivo de esta charla es presentar un panorama de algunos de los temas actuales de investigaci&oacute;n en bases de datos y b&uacute;squeda de informaci&oacute;n. En particular, se describir&aacute;n los temas de investigaci&oacute;n en los que se est&aacute; trabajando, los proyectos de investigaci&oacute;n en curso, los grupos con los que se est&aacute;n realizando trabajos conjuntos y algunos resultados.</p>
      <p class="resumen">Con la evoluci&oacute;n de las tecnolog&iacute;as de la informaci&oacute;n y las comunicaciones, han surgido almacenamientos no estructurados de informaci&oacute;n, tales como texto libre, im&aacute;genes, audio y video. <span class="leer-mas" onClick="javascript:showAbstract('deco');">[Leer m&aacute;s]</span></p>
      </div>
      
      <div id="decoCompleto" style="display:none"> 
        <p class="resumen">El objetivo de esta charla es presentar un panorama de algunos de los temas actuales de investigaci&oacute;n en bases de datos y b&uacute;squeda de informaci&oacute;n. En particular, se describir&aacute;n los temas de investigaci&oacute;n en los que se est&aacute; trabajando, los proyectos de investigaci&oacute;n en curso, los grupos con los que se est&aacute;n realizando trabajos conjuntos y algunos resultados.</p>
      <p class="resumen">Con la evoluci&oacute;n de las tecnolog&iacute;as de la informaci&oacute;n y las comunicaciones, han surgido almacenamientos no estructurados de informaci&oacute;n, tales como texto libre, im&aacute;genes, audio y video. Esto requiere modelos m&aacute;s generales que las bases de datos tradicionales. Es decir, nuevos modelos tales como bases de datos de texto o bases de datos m&eacute;tricas. Y, por lo tanto, se requiere contar con m&eacute;todos y t&eacute;cnicas que permitan realizar b&uacute;squedas eficientes sobre estos tipos de datos. Por un lado se propone un refinamiento sem&aacute;ntico que utiliza conocimiento ling&uuml;&iacute;stico, para la preparaci&oacute;n de una estrategia de b&uacute;squeda que represente la necesidad de informaci&oacute;n del usuario. Por otro lado, la consulta en bases de datos tradicionales est&aacute; construida sobre el concepto de b&uacute;squeda exacta, donde los resultados de la consulta son aquellos registros que tienen una coincidencia exacta con la clave de b&uacute;squeda ingresada. Entonces surge el concepto de b&uacute;squeda por similitud o b&uacute;squeda  por proximidad, que consiste en recuperar los elementos m&aacute;s similares o cercanos al elemento dado en la consulta. La similitud se modela con una funci&oacute;n de distancia que satisface la desigualdad triangular, y el conjunto de objetos es llamado espacio m&eacute;trico. <span class="leer-mas" onClick="javascript:hideAbstract('deco');">[Ocultar]</span></p>
      </div>    </td>
  </tr>
  <tr>
    <td class="horario">10:30<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Context Aware Computing - Desaf&iacute;os de una Implementaci&oacute;n Pr&aacute;ctica</span><br>
        <span class="disertante">Pablo Garralda (Intel)</span> </p>
      <p class="resumen">El objetivo de esta presentaci&oacute;n es introducir los conceptos b&aacute;sicos de &quot;Context Aware Computing&quot; y enumerar las problem&aacute;ticas con las que debe lidiar la implementaci&oacute;n de una plataforma para el soporte de aplicaciones que utilicen Context Aware Computing.</p></td>
  </tr>
  <tr>
    <td class="horario">11:30<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Implementaci&oacute;n de puntos de acceso gratuito WiFi utilizando Software Libre</span><br>
        <span class="disertante">Javier Kohan - Federico Lazcano</span> <a href="slides/2007-kohan-lazcano.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <p class="resumen">Esta charla muestra los detalles del Piloto de acceso gratuito a Internet mediante WiFi, en el marco del proyecto de Ciudad Digital de la Municipalidad de Rosario. En esta implementaci&oacute;n se realiz&oacute; utilizando exclusivamente software libre, tanto en los puntos de acceso como en el servidor concentrador. Las tecnolog&iacute;as utilizadas incluyen OpenWRT, OpenVPN, Wifidog y Debian GNU/Linux, entre otras.</p></td>
  </tr>
  <tr>
    <td colspan="2" class="receso">Receso</td>
  </tr>
  <tr>
    <td class="horario">14:00<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Simulaci&oacute;n de Sistemas Continuos. Principios B&aacute;sicos y algunos Avances Recientes.</span><br>
        <span class="disertante">Ernesto Kofman      </span><a href="slides/2007-kofman.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <div id="kofmanChico" style="display:inline;"><p class="resumen">El t&eacute;rmino Sistemas Continuos se refiere a los modelos matem&aacute;ticos de sistemas que cambian continuamente con el tiempo, representados por distintos tipos de Ecuaciones Diferenciales. Este tipo de sistemas se encuentra habitualmente en la f&iacute;sica (mec&aacute;nica, hidr&aacute;ulica, electromagnetismo, termodin&aacute;mica), en la qu&iacute;mica, en diversas aplicaciones de la ingenier&iacute;a, en la econom&iacute;a, en la din&aacute;mica de poblaciones, etc.</p>
      <p class="resumen">Si queremos saber como se va a comportar un sistema continuo, debemos resolver la ecuaci&oacute;n diferencial correspondiente, lo que en general implica recurrir a soluciones num&eacute;ricas con la ayuda de sistemas de c&oacute;mputo. Esta resoluci&oacute;n num&eacute;rica se suele denominar &quot;Simulaci&oacute;n&quot;. <span class="leer-mas" onClick="javascript:showAbstract('kofman');">[Leer m&aacute;s]</span></p></div>
      <div id="kofmanCompleto" style="display:none">
        <p class="resumen">El t&eacute;rmino Sistemas Continuos se refiere a los modelos matem&aacute;ticos de sistemas que cambian continuamente con el tiempo, representados por distintos tipos de Ecuaciones Diferenciales. Este tipo de sistemas se encuentra habitualmente en la f&iacute;sica (mec&aacute;nica, hidr&aacute;ulica, electromagnetismo, termodin&aacute;mica), en la qu&iacute;mica, en diversas aplicaciones de la ingenier&iacute;a, en la econom&iacute;a, en la din&aacute;mica de poblaciones, etc.</p>
        <p class="resumen">Si queremos saber como se va a comportar un sistema continuo, debemos resolver la ecuaci&oacute;n diferencial correspondiente, lo que en general implica recurrir a soluciones num&eacute;ricas con la ayuda de sistemas de c&oacute;mputo. Esta resoluci&oacute;n num&eacute;rica se suele denominar &quot;Simulaci&oacute;n&quot;. La simulaci&oacute;n de sistemas continuos es una disciplina que, de la mano con el poder de c&aacute;lculo de las computadoras, ha experimentado un desarrollo creciente en las &uacute;ltimas d&eacute;cadas.</p>
        <p class="resumen">El primer objetivo de la charla ser&aacute; entonces brindar un panorama general sobre la disciplina, dando un pantallazo sobre los m&eacute;todos, aplicaciones, dificultades, herramientas de software, etc. &nbsp;Tras esto, haremos menci&oacute;n a algunos avances recientes en la disciplina en los cuales un grupo del Laboratorio de Sistemas Din&aacute;micos y Procesamiento de la Informaci&oacute;n (de nuestra Facultad) ha trabajado activamente.</p>
        <p class="resumen">Como veremos, todos los m&eacute;todos de simulaci&oacute;n convencionales discretizan el eje de tiempo y obtienen un sistema de ecuaciones en diferencia (de tiempo discreto) que, en principio, aproxima al sistema continuo original. Nos referiremos entonces a una nueva familia de m&eacute;todos que, manteniendo la continuidad del eje de tiempo, cuantifican las variables de estado del sistema. En consecuencia, el sistema aproximado resultante no es ya de &quot;tiempo discreto&quot; sino de &quot;eventos discretos&quot;.</p>
        <p class="resumen">Estos nuevos m&eacute;todos de simulaci&oacute;n (denominados QSS por Quantized State Systems) tienen propiedades te&oacute;ricas y pr&aacute;cticas esencialmente distintas a las de los m&eacute;todos convencionales, presentando en algunos casos ventajas notables. Siendo adem&aacute;s un &aacute;rea de muy reciente desarrollo, presenta muchos problemas abiertos que pueden constituirse en temas de investigaci&oacute;n tanto en inform&aacute;tica como en matem&aacute;ticas e ingenier&iacute;as afines. <span class="leer-mas" onClick="javascript:hideAbstract('kofman');">[Ocultar]</span></p>
      </div></td>
  </tr>
  <tr>
    <td class="horario">15:00<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Imponiendo Nointerferencia al Ejecutar tantos Procesos como Niveles de Seguridad</span><br>  
          <span class="disertante">Maximiliano Cristi&aacute;</span> <a href="slides/2007-cristia.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <p align="justify" class="resumen">Se presentar&aacute; una t&eacute;cnica para imponer nointerferencia al ejecutar los programas con una sem&eacute;ntica operacional no est&aacute;ndar que esencialmente corre una versi&oacute;n del programa (proceso) por nivel de seguridad. Los efectos de E/S de cada uno de estos procesos se controlan prohibiendo que cada uno escriba en dispositivos con el mismo nivel o superior. Este mecanismo intenta resolver los problemas que persisten en las t&eacute;cnicas basadas en el an&aacute;lisis est&aacute;tico de c&oacute;digo para calcular la nointerferencia de un programa. En efecto, la t&eacute;cnica que se presentar&aacute; no requiere examinar los programas sino modificar el sistema operativo el cual ser&aacute; el &uacute;nico responsable de evitar la filtraci&oacute;n de secretos. Por lo tanto es muy compatible con el c&oacute;digo existente.</p></td>
  </tr>
  <tr>
    <td class="horario">16:00<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">Una Conexi&oacute;n Formal entre Propiedades de Seguridad y Anotaciones JML</span><br>
        <span class="disertante">Alejandro Tamalet</span> <a href="slides/2007-tamalet.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <div id="tamaletChico" style="display:inline;"> 
        <p class="resumen">Con el advenimiento de una nueva generaci&oacute;n de dispositivos personales (smart phones, PDA, smart cards, etc), la necesidad de garantizar ciertas propiedades del software es innegable. El hecho de que gran parte estos dispositivos est&eacute;n conectados a redes y que permitan la ejecuci&oacute;n de programas complejos los hace muy vulnerables a ataques. Los efectos de un ataque, que desconecte o inutilize masivamente dichos dispositivos, ser&iacute;an devastadores.</p>
        <p class="resumen">Unos de los enfoques tradicionales para garantizar la seguridad de una aplicaci&oacute;n es monitorear su ejecuci&oacute;n con un aut&oacute;mata de seguridad. Los eventos de dicho aut&oacute;mata son disparados por acciones ejercidas por el programa.  <span class="leer-mas" onClick="javascript:showAbstract('tamalet');">[Leer m&aacute;s]</span></p>
      </div>
      <div id="tamaletCompleto" style="display:none">
        <p class="resumen">Con el advenimiento de una nueva generaci&oacute;n de dispositivos personales (smart phones, PDA, smart cards, etc), la necesidad de garantizar ciertas propiedades del software es innegable. El hecho de que gran parte estos dispositivos est&eacute;n conectados a redes y que permitan la ejecuci&oacute;n de programas complejos los hace muy vulnerables a ataques. Los efectos de un ataque, que desconecte o inutilize masivamente dichos dispositivos, ser&iacute;an devastadores.</p>
        <p class="resumen">Unos de los enfoques tradicionales para garantizar la seguridad de una aplicaci&oacute;n es monitorear su ejecuci&oacute;n con un aut&oacute;mata de seguridad. Los eventos de dicho aut&oacute;mata son disparados por acciones ejercidas por el programa. Si el programa intenta violar la propiedad que el aut&oacute;mata describe se pueden tomar acciones correctivas o simplemente abortar el programa. Pero en &uacute;ltima instancia estamos interesados en provar que la propiedad es satisfecha para toda ejecuci&oacute;n del programa, evitando de este modo la necesidad de monitorear la aplicaci&oacute;n. Esto es particularmente importante en dispositivos donde el poder de c&oacute;mputo es un preciado recurso.</p>
        <p class="resumen">En esta charla hablar&eacute; sobre el trabajo en curso que estoy realizando como estudiante de doctorado de la universidad Radboud situada en los Nijmegen, Paises Bajos, en conjunto con Marieke Huisman de INRIA Sophia-Antipolis, Francia. Nuestra propuesta es transformar aut&oacute;matas de seguridad en anotaciones JML. JML o Java Modeling Language es un lenguage de especificaciones para Java que permite entre otras cosas agregar contratos a las interfaces (precondiciones, postcondiciones e invariantes). La ventaja de usar JML es que podemos chequear que las aserciones se cumplen en tiempo de ejecuci&oacute;n, obteniendo de esa manera un monitor de ejecuci&oacute;n. Pero adem&aacute;s, dependiendo de c&oacute;mo sean generadas las anotaciones, podemos usar herramientas como ESC/Java2 para probar las propiedades est&aacute;ticamente.</p>
        <p class="resumen">La principal contribuci&oacute;n de este trabajo es la formalizaci&oacute;n y prueba de la correctitud del algoritmo de generaci&oacute;n de anotaciones. Para ello estamos usando el demostrador de teoremas PVS. La formalizaci&oacute;n incluye dar una definici&oacute;n formal para los aut&oacute;matas de seguridad junto con una sem&aacute;tica operacional, un subconjunto de Java que incluye anotaciones JML, una sem&aacute;ntica operacional big step para dichos programas, una definici&oacute;n de programas monitoreados y una relaci&oacute;n de equivalencia entre los estados un programa anotado y un programa monitoreado. La prueba se basa en mostrar que existe una bisimulaci&oacute;n entre el programa monitoreado y el programa anotado. <span class="leer-mas" onClick="javascript:hideAbstract('tamalet');">[Ocultar]</span></p>
      </div></td>
  </tr>
  <tr>
    <td class="horario">17:00<br>
      <span class="emph-red">Aula 14</span></td>
    <td><p><span class="charlaInvitado">La Venganza del Goto</span><br>
        <span class="disertante">Guido Macchi</span> <a href="slides/2007-macchi.pdf"><img src="img/slides.png" alt="Presentaci&oacute;n" width="32" height="13" vspace="2" align="absmiddle" class="slides"></a></p>
      <p class="resumen">Se expone brevemente el nacimiento de las continuaciones y el homomorfismo de Howard-Curry. Luego se comenta una extensi&oacute;n a dicho homomorfismo, para incluir l l&oacute;gica cl&aacute;sica. Al final hay caf&eacute;.</p></td>
  </tr>
  <tr>
    <td class="horario">18:15</td>
    <td><p class="charlaInvitado">Panel de Debate</p>      </td>
  </tr>
  <tr>
    <td class="horario">19:45</td>
    <td><p class="charlaInvitado">Acto de clausura y entrega de diplomas de fin de cursado <span class="emph-red">*</span></p>      </td>
  </tr>
  <tr>
    <td class="horario">20:30</td>
    <td><p class="charlaInvitado">Cena de camarader&iacute;a <span class="emph-red">*</span></p>      </td>
  </tr>
</table>
<p align="justify">Otras actividades:</p>
<ul>
  <li>Partido de F&uacute;tbol
    <span class="emph-red">*</span>
    <ul>
      <li>D&iacute;a y hora: S&aacute;bado 13 de Octubre, 14:00 hs.</li>
      <li>Lugar: La Siberia
      </li>
      </ul>
    </li>
  </ul>
  <p class="emph-red">* Actividades conjuntas de la Escuela de Ciencias Exactas.</p></td>
<td width="10" rowspan="2">&nbsp;</td>
	</tr>
	  <tr valign="top">
	    <td><br>
          <center>
            <p class="foot"><em>:: Departamento de Ciencias de la Computaci&oacute;n ::
                <br>
              ::
              Facultad de Ciencias Exactas, Ingenier&iacute;a y Agrimensura ::
              Universidad Nacional de Rosario ::            </em>
                <br>
                <br>
            </p>
            </center>          </td>
	    </tr>
</tbody></table>
</td></tr></tbody></table>
</center>
</body></html>

<!--
<div id="Chico" style="display:inline;"> 
	<span class="leer-mas" onClick="javascript:showAbstract('');">[Leer m&aacute;s]</span></p>
</div>

<div id="Completo" style="display:inline"> 
	<span class="leer-mas" onClick="javascript:hideAbstract('');">[Ocultar]</span></p>
</div>
-->
